Revit 2017 API
DialogBoxShowingEventArgs Properties
The DialogBoxShowingEventArgs type exposes the following members.
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
DialogId
 A unique string identifier for DialogBox and TaskDialog type dialogs in Revit.
HelpId |  Obsolete.
 An ID that represents the dialog that has been displayed.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
See Also
DialogBoxShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace